'use client'

import React, {useState} from 'react';
import KeyboardArrowDownIcon from '@mui/icons-material/KeyboardArrowDown';
import styles from './FAQ.module.sass';
import Button from "@mui/material/Button";
import Container from "@/app/components/container";

function FAQ() {
    const [visibleId, setVisibleId] = useState(null);
    const [showMore, setShowMore] = useState(false);

    const faqs = [
        {
            id: 1,
            question: "سوپرلید چیست و چه کاربردی دارد؟",
            answer: "سوپرلید یک درب محافظتی برای عقب وانت و کامیونت‌ها است که از محموله‌ها در برابر عوامل طبیعی و سرقت محافظت می‌کند. سوپرلیدها معمولاً ضدآب و دارای قفل امنیتی هستند."
        },
        {
            id: 2,
            question: "مزایای استفاده از باکس در خودروهای آفرود چیست؟",
            answer: "باکس‌های آفرود برای نگهداری ابزار و لوازم ضروری در سفرهای آفرود مناسب هستند و فضای ذخیره‌سازی ایمنی را فراهم می‌کنند. این باکس‌ها ضدضربه و ضدآب طراحی شده‌اند."
        },
        {
            id: 3,
            question: "گارد عقب و جلو چه اهمیتی در خودروهای آفرود دارند؟",
            answer: "گاردهای عقب و جلو برای محافظت از خودرو در برابر ضربات و برخوردها در جاده‌های ناهموار و هنگام رانندگی آفرود نصب می‌شوند. این گاردها از سپر و بدنه خودرو محافظت کرده و در کاهش آسیب‌ها مؤثرند."
        },
        {
            id: 4,
            question: "بکسل بند چیست و در چه مواقعی به آن نیاز داریم؟",
            answer: "بکسل بند وسیله‌ای است که برای بکسل کردن خودروها در شرایط سخت و گیر کردن در مسیرهای ناهموار استفاده می‌شود. این ابزار به خودروها کمک می‌کند تا در مواقع گیر کردن به راحتی بیرون کشیده شوند."
        },
        {
            id: 5,
            question: "گوشواره کمک فنر چگونه به بهبود عملکرد خودرو کمک می‌کند؟",
            answer: "گوشواره کمک فنر باعث افزایش پایداری و استحکام خودرو در مسیرهای سخت می‌شود و به کاهش لرزش‌ها و بهبود رانندگی کمک می‌کند."
        },
        {
            id: 6,
            question: "مزایای استفاده از باربند سقفی در خودروهای آفرود چیست؟",
            answer: "باربند سقفی امکان حمل بار و وسایل بیشتر را فراهم می‌کند. این محصول برای حمل لوازم آفرود و سفرهای طولانی بسیار مفید است و فضای داخلی خودرو را آزاد نگه می‌دارد."
        },
        {
            id: 7,
            question: "رول بال چیست و چه کاربردی در خودرو دارد؟",
            answer: "رول بال نوعی محافظ برای بار در خودروهای وانت است که امکان محافظت از محموله و نیز قرار دادن بار بر روی سطح آن را فراهم می‌کند. رول بال‌ها از جنس مقاوم ساخته شده و امنیت بیشتری را برای محموله‌ها فراهم می‌کنند."
        },
        {
            id: 8,
            question: "لاینر یا کفی عقب چه مزایایی دارد؟",
            answer: "لاینر، یا کفی عقب، برای محافظت از کف خودرو در قسمت بار استفاده می‌شود. این محصول ضد لغزش و ضد آب بوده و از آسیب به کف عقب خودرو در برابر ضربه و سایش محافظت می‌کند."
        },
        {
            id: 9,
            question: "سپر اسپورت چه ویژگی‌ها و کاربردهایی دارد؟",
            answer: "سپر اسپورت علاوه بر ظاهر زیبا، به حفاظت بهتر از جلوی خودرو کمک می‌کند. این سپرها سبک و مقاوم هستند و در طراحی خودروهای آفرود بسیار محبوبند."
        },
        {
            id: 10,
            question: "انواع پروژکتورها در خودروهای آفرود چه کاربردی دارند؟",
            answer: "پروژکتورهای آفرود، مانند پروژکتورهای مه شکن و چراغ‌های LED، در شرایط دید کم و رانندگی شبانه کمک می‌کنند. این پروژکتورها نور قوی و پایداری را ارائه می‌دهند و ایمنی رانندگی در مسیرهای دشوار را افزایش می‌دهند."
        },
        {
            id: 11,
            question: "چگونه بهترین تجهیزات آفرود برای خودروی خود را انتخاب کنیم؟",
            answer: "انتخاب تجهیزات آفرود بستگی به نوع خودرو، مسیرهای مورد نظر و نوع استفاده شما دارد. بررسی مقاومت، برند و کیفیت محصولات می‌تواند به شما در انتخاب بهتر کمک کند."
        },
        {
            id: 12,
            question: "آیا نصب گارد و سپر بر روی خودرو تأثیری بر ایمنی دارد؟",
            answer: "نصب گارد و سپر باعث افزایش حفاظت و ایمنی خودرو در مسیرهای ناهموار و آفرود می‌شود. با این حال، باید از محصولات استاندارد و با کیفیت استفاده کنید تا ایمنی به حداکثر برسد."
        },
        {
            id: 13,
            question: "برای محافظت از بار در خودروهای آفرود چه تجهیزاتی توصیه می‌شود؟",
            answer: "استفاده از سوپرلید، رول بال و باکس‌های مقاوم توصیه می‌شود. این تجهیزات باعث می‌شوند بارها در برابر سرقت و آسیب‌های احتمالی در سفرهای آفرود محافظت شوند."
        },
        {
            id: 14,
            question: "چه نوع پروژکتوری برای آفرود مناسب است؟",
            answer: "پروژکتورهای LED و پروژکتورهای مه شکن برای آفرود بسیار مناسب هستند. این پروژکتورها به شما امکان می‌دهند در شرایط کم‌نور و مه‌آلود با دید بهتری رانندگی کنید."
        },
        {
            id: 15,
            question: "چگونه از تجهیزات آفرود خود مراقبت کنیم؟",
            answer: "برای مراقبت از تجهیزات آفرود خود باید آن‌ها را به طور منظم تمیز کرده و از آسیب‌های خارجی مانند ضربه و خراش جلوگیری کنید. نگهداری صحیح، مانند چک کردن پیچ‌ها و قفل‌ها، به طول عمر محصولات کمک می‌کند."
        },
        {
            id: 16,
            question: "آیا نصب تجهیزات آفرود به عملکرد خودرو آسیب می‌زند؟",
            answer: "اگر تجهیزات آفرود به درستی نصب شوند و از محصولات با کیفیت استفاده کنید، آسیب به عملکرد خودرو نخواهید دید. در غیر این صورت، نصب نادرست یا استفاده از محصولات بی‌کیفیت ممکن است به سیستم‌های مختلف خودرو آسیب بزند."
        },
        {
            id: 17,
            question: "چه نوع لاستیکی برای سفرهای آفرود مناسب است؟",
            answer: "لاستیک‌های آفرود مخصوص مسیرهای ناهموار و سخت طراحی شده‌اند. این لاستیک‌ها با الگوی خاص آج، مقاوم در برابر سایش و مناسب برای حرکت در گل و لای یا سنگلاخ هستند."
        },
        {
            id: 18,
            question: "چگونه می‌توانم از پروژکتورهای آفرود استفاده کنم؟",
            answer: "پروژکتورهای آفرود معمولاً برای روشنایی بیشتر در مسیرهای تاریک و در شرایط خاص مانند مه یا برف استفاده می‌شوند. باید آن‌ها را در مکان مناسب روی خودرو نصب کرده و از کنترل روشنایی آن‌ها در شرایط خاص بهره ببرید."
        },
        {
            id: 19,
            question: "آیا تجهیزات آفرود باعث افزایش مصرف سوخت می‌شود؟",
            answer: "بله، نصب برخی تجهیزات آفرود مانند گاردهای بزرگ یا باربند‌ها ممکن است مقاومت هوا را افزایش دهد و مصرف سوخت خودرو را کمی افزایش دهد. اما این تاثیر معمولاً در مقایسه با مزایای آن‌ها در سفرهای آفرود کوچک است."
        }
    ];
    const dataLength = showMore ? faqs : faqs.slice(0, 5);

    const toggleAnswer = (id: any) => {
        setVisibleId(prevId => (prevId === id ? null : id));
    };

    const toggleShowMore = () => {
        setShowMore(!showMore);
    };

    return (
        <div className={styles.FAQ} id="FAQ" dir="rtl">
            <Container className={styles.container}>
                <h2 className={styles.FQTitle}>سوالات متداول</h2>
                <ul>
                    {dataLength.map(faq => (
                        <li key={faq.id}>
                            <div onClick={() => toggleAnswer(faq.id)}>
                                <p>
                                    <span style={{color: 'var(--primary-color)', marginLeft: '3px'}}>{faq.id}.</span>
                                    {faq.question}
                                    <KeyboardArrowDownIcon
                                        style={{color: 'var(--primary-color)'}}
                                        className={`${styles.icon} ${visibleId === faq.id ? styles.iconRotated : ''}`}
                                    />
                                </p>
                            </div>
                            {visibleId === faq.id && <p className={styles.answer}>{faq.answer}</p>}
                        </li>
                    ))}
                </ul>
                <Button
                    onClick={toggleShowMore}
                    variant="contained"
                >
                    {showMore ? 'نمایش کمتر...' : ' نمایش بیشتر...'}
                </Button>
            </Container>
        </div>
    );
}

export default FAQ;